{
    "curr_lang": "fr",
    "general": {
        "website": "Site",
        "description": "Salutations, je suis Quentin, et bienvenue sur mon ePortFolio recensant mes divers projets!",
        "whatidid": "Qu'ai-je fait?",
        "whatwedid": "Qu'avons-nous fait?",
        "style_guide": "Charte Graphique",
        "general_idea": "Idée générale",
        "colours": "Couleurs",
        "fonts": "Polices",
        "libraries": "Librairies",
        "what_about": "De quoi s'agit-il ?",
        "lib_style_guide": "Librairies & Charte Graphique",
        "lib_lang": "Librairies & Langage"
    },
    "header": {
        "about": "À propos",
        "dev_projects": "Développement de jeux",
        "other_projects": "Autres projets informatique",
        "terminal": "Le mot de la fin"
    },
    "links": {
        "p_base": "../",
        "en_link": "../",
        "fr_link": ""
    },
    "main": {
        "intro": "Bonjour à tous, et bienvenue sur mon ePortFolio. Vous pourrez trouver sur cette page diverses informations sur mes projets et ma personne. Bonne visite!",
        "function": "Étudiant à l'IUT Informatique de Montpellier",
        "author": "Le template de ce site a été créé par Adrien Luitot, et est Open Source.",
        "copyright": "Il est sous licence MIT et disponible sur <span style=\"color: #f69e7b;\">[<a href=\"https://github.com/adrienluitot/personal-website\" rel=\"nofollow\" target=\"_blank\">github</a>](<a href=\"https://github.com/adrienluitot/personal-website\" rel=\"nofollow\" target=\"_blank\">https://github.com/adrienluitot/adrienluitot.github.io</a>)</span>.",
        "contact": "Envie de me contacter ? Pas de soucis, envoyez-moi un e-mail : <span style=\"color: #e84a5f;font-style: italic;\">*contact[at]adrien.luitot.fr*</span>"
    },
    "projects": {
        "close_project": "Fermer",
        "analystesJoomla": {
            "short_desc": "Un site créé à l'aide de Joomla",
            "tldr": "Ce site a été créé à l'aide de Joomla et de la méthode AGILE dans le cadre d'un projet de second semestre de l'IUT",
            "whatidid": "Le projet tuteuré de second semestre à l'IUT nous a fait travailler en groupes de 7 dans l'optique de créer un site pour un client demandant un portail pour ses étudiants en licence pro. À l'aide de la méthode AGILE, d'une utilisation intensive de Trello et de Joomla, nous continuons de valider les stories les unes après les autres.",
            "joomla_desc": "C'est à l'aide du CMS Joomla que nous développons le site."
        },
        "bang": {
            "short_desc": "",
            "tldr": "",
            "whatidid": "",
            "general_idea": ""
        },
        "cryptenger": {
            "short_desc": "Une messagerie chiffrée",
            "tldr": "Cryptenger est une messagerie chiffrée et légère. Son but est d'être une jolie application avec un serveur que tout le monde peu initialiser facilement.",
            "whatwedid": "Au début ce projet était pour les cours, nous étions 3 amis, et nous voulious faire une messagerie complètement sécurisée, mais aussi facile d'utilisation que Discord ou WhatsApp. Pour la partie sécurisée nous voulions chiffrer les messages, mais parce qu'il est impossible de savoir si on est espionné par le serveur nous avons décidé de laisser la possibilité aux personnes d'initialiser leurs propres serveurs. Pour chiffrer les messages nous initialisons la connexion avec un chiffrement asymétrique puis échangeons la clé symétrique qui chiffrera et déchiffrera les messages suivants.",
            "client_t": "Client",
            "server_t": "Serveur",
            "white": "Blanc",
            "dark_grey": "Gris Foncé",
            "darky_grey": "Gris Sombre",
            "python_desc": "Nous avons utilisé <b>Python</b>, qui est un plutôt bon langage pour des petits projets comme celui ci, mais nous étions également limité par les règles du projet.",
            "crypt_desc": "Pour le chiffrement nous avons utilisé les librairies Python Cyptography pour la partie asymétrique et PyCryptoDome pour la partie symétrique.",
            "client": {
                "about": "Le client est très simple, il y a un fenêtre de connextion puis ça envoie vers le server. Le server est divisé par channels.",
                "style_guide": "Nous avons tous donné nos idée pour la charte graphique générale et le logo a été fait par <a href=\"https://www.artstation.com/quentin_costagliola\" target=\"_blank\" rel=\"nofollow\">Quentin</a>.",
                "qt_desc": "Nous avons utilisé Qt, et plus précisement PyQt, pour l'interface de l'application. De mon point de vue c'est un peu plus compliqué que PyGObject mais ça reste très efficace !"
            },
            "server": {
                "about": "Le serveur est géré via un script python et configuré grâce à un fichier JSON. Une amélioration possible serait de faire un script plus proche des commandes Unix pour le gérer.",
                "style_guide": "C'est un script donc il n'y pas d'interface si ce n'est celle de votre terminal. ^^"
            }
        },
        "gravityDodge": {
            "short_desc": "Un jeu mobile Free to Play",
            "tldr": "Gravity Dodge est mon premier projet Unity, j'ai expérimenté avec, et je compte le publier un jour.",
            "whatidid": "",
            "general_idea": ""
        },
        "heartbeat": {
            "short_desc": "Une extension pour le jeu Steam Hacknet.",
            "tldr": "",
            "whatidid": "",
            "general_idea": ""
        },
        "spaceOdyssey": {
            "short_desc": "Un jeu Unity gagnant de la 5e Code Game Jam.",
            "tldr": "",
            "whatidid": "",
            "general_idea": ""
        },

        "stilexHuminex": {
            "short_desc": "Un site internet vendant un produit fictif.",
            "tldr": "",
            "whatidid": "",
            "general_idea": ""
        }
    }
}